In [ ]:
!pip install SQLAlchemy==1.4.39
%load_ext sql
%sql sqlite://

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS employees(employee_num integer,
                                    last_name text,
                                    first_name text,
                                    salary text,
                                    dept_id integer,
                                    age integer);
CREATE TABLE IF NOT EXISTS managers(mgr_num integer,
                                    last_name text,
                                    first_name text,
                                    salary text,
                                    dept_id integer,
                                    age integer);

In [ ]:
%%sql

INSERT INTO employees VALUES(1001, 'Smith','John', 62000, 500,32);
INSERT INTO employees VALUES(1002, 'Anderson','Jane', 87500, 500,40);
INSERT INTO employees VALUES(1003, 'Everest','Brad', 71000, 501,26);
INSERT INTO employees VALUES(1004, 'Horvath','Brain', 62000, 501,44);

INSERT INTO managers VALUES(101, 'White','Jonathan', 152000, 500,38);
INSERT INTO managers VALUES(102, 'Smith','Paul', 120000, 501,40);
INSERT INTO managers VALUES(103, 'Cowgill','Richard', 150000, 502,50);

In [ ]:
##Display employees older than 30 years old (expected output: last_name, first_name, age)
%%sql

select last_name, first_name, age
from employees
where age> 30;

In [ ]:
##Display employees whose first names end in “n”( expected output: last_name, first_name)
%%sql

select last_name, first_name
from employees
where first_name like '%n';

In [ ]:
##Find managers make more than $130k and less than $160k. (expected output: last_name, first_name, salary)
%%sql

select last_name, first_name, salary
from managers
where salary >  130000 AND salary < 160000;

In [ ]:
##Find employees older than his/her manager (expected output: emp_LastName, emp_FirstName, mgr_LastName, mgr_FirstName, ageDiff) Hint: ageDiff = employees.age – managers.age
%%sql

select e.first_name as emp_firstName, e.last_name as emp_lastName, m.first_name as  mgr_firstName,
       m.last_name as magr_lastName, e.age-m.age as ageDiff
from employees e, managers m
where e.age > m.age;